Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# Menu_Data_RepeatOperation.Text
source: Repeat last data operation
ar: تكرار آخر عملية بيانات
cs: Opakovat poslední datovou operaci
de: Letzte Datenoperation wiederholen
el: Επανάληψη τελευταίας πράξης δεδομένων
es: Repetir la última operación de datos
fa: تکرار آخرین عملیات داده
fr: Répéter la dernière opération
hu: Utolsó adatművelet ismétlése
id: Ulangi Operasi Data Terakhir
it: Ripeti ultima operazione sui dati
ja: 前回のデータ演算を繰り返す(R)
ko: 마지막 데이터 연산 반복(R)
pl: Powtórz ostatnią operację na danych
pt: Repetir última operação de dados
ro: Repetare ultima operație pe date
th: ทำการดำเนินการข้อมูลล่าสุดซ้ำ(R)
tr: Son veri işlemini yinele
uk: Повторити останню операцію з даними
vi: Lặp lại Phép toán Dữ liệu Gần nhất
zh_hans: 重复上次数据运算(R)
zh_hant: 重複上次的資料運算(R)

# Menu_Data_RepeatOperation.AccessKey
source: R
ar: ر
cs: O
de: L
el: Ε
fa: ت
hu: U
id: U
pl: P
tr: Y
uk: П
vi: L

# Menu_Data_ConvertEncoding.Text
source: Convert encoding...
ar: تحويل الترميز...
cs: Převést kódování...
de: Codierung konvertieren...
el: Μετατροπή κωδικοποίησης...
es: Convertir codificación...
fa: تبدیل رمزگذاری...
fr: Convertir l'encodage...
hu: Kódolás átalakítása...
id: Konversi Pengodean...
it: Converti codifica...
ja: 文字コード変換(E)...
ko: 인코딩 변환(E)...
pl: Konwertuj kodowanie...
pt: Converter codificação...
ro: Conversie codificare...
th: แปลงการเข้ารหัส(E)...
tr: Kodlamayı dönüştür...
uk: Перетворити кодування...
vi: Chuyển đổi Bảng mã...
zh_hans: 转换编码(E)...
zh_hant: 轉換編碼(E)...

# Menu_Data_ConvertEncoding.AccessKey
source: E
ar: ت
cs: P
de: C
el: Μ
es: C
fa: ب
fr: C
hu: K
id: K
it: C
pl: K
pt: C
ro: C
tr: K
uk: К
vi: B

# Menu_Data_Case.Text
source: Change case
ar: تغيير حالة الأحرف
cs: Změnit velikost písmen
de: Groß-/Kleinschreibung ändern
el: Αλλαγή πεζών-κεφαλαίων
es: Cambiar mayúsculas y minúsculas
fa: تغییر بزرگی و کوچکی حروف
fr: Changer la casse
hu: Kis- és nagybetűk
id: Ubah Huruf Besar/Kecil
it: Cambia maiuscole/minuscole
ja: 大文字・小文字の変換(C)
ko: 대/소문자 변환(C)
pl: Zmień wielkość liter
pt: Alterar maiúsculas/minúsculas
ro: Modificare majuscule/minuscule
th: เปลี่ยนตัวพิมพ์(C)
tr: Büyük/küçük harf değiştir
uk: Змінити регістр
vi: Đổi Chữ hoa/thường
zh_hans: 更改大小写(C)
zh_hant: 變更大小寫(C)

# Menu_Data_Case.AccessKey
source: C
ar: ح
cs: Z
de: G
el: Λ
es: M
fa: غ
fr: L
hu: N
id: H
it: M
pl: Z
pt: A
ro: M
tr: B
uk: Р
vi: H

# Menu_Data_CaseUpper.Text
source: Uppercase
ar: أحرف كبيرة
cs: Velká písmena
de: Großbuchstaben
el: Κεφαλαία
es: Mayúsculas
fa: حروف بزرگ
fr: Majuscules
hu: Nagybetűs
id: Huruf Besar
it: Maiuscole
ja: 大文字に(U)
ko: 대문자로(U)
pl: Wielkie litery
pt: Maiúsculas
ro: Majuscule
th: ตัวพิมพ์ใหญ่(U)
tr: Büyük harf
uk: Великі літери
vi: Chữ hoa
zh_hans: 大写(U)
zh_hant: 大寫(U)

# Menu_Data_CaseUpper.AccessKey
source: U
ar: ك
cs: V
de: G
el: Κ
es: M
fa: ح
fr: M
hu: N
id: B
it: M
pl: W
pt: M
ro: M
tr: B
uk: В
vi: H

# Menu_Data_CaseLower.Text
source: Lowercase
ar: أحرف صغيرة
cs: Malá písmena
de: Kleinbuchstaben
el: Πεζά
es: Minúsculas
fa: حروف کوچک
fr: Minuscules
hu: Kisbetűs
id: Huruf Kecil
it: Minuscole
ja: 小文字に(L)
ko: 소문자로(L)
pl: Małe litery
pt: Minúsculas
ro: Minuscule
th: ตัวพิมพ์เล็ก(L)
tr: Küçük harf
uk: Малі літери
vi: Chữ thường
zh_hans: 小写(L)
zh_hant: 小寫(L)

# Menu_Data_CaseLower.AccessKey
source: L
ar: ص
cs: M
de: K
el: Ζ
es: I
fa: ک
fr: I
hu: K
id: K
it: I
pl: M
pt: I
ro: I
tr: K
uk: М
vi: T

# Menu_Data_CaseSwap.Text
source: Swap case
ar: تبديل حالة الأحرف
cs: Prohodit velikost písmen
de: Groß-/Kleinschreibung umkehren
el: Εναλλαγή πεζών-κεφαλαίων
es: Invertir mayúsculas y minúsculas
fa: جابه‌جایی بزرگی و کوچکی حروف
fr: Inverser la casse
hu: Kis- és nagybetűk felcserélése
id: Tukar Huruf Besar/Kecil
it: Inverti maiuscole/minuscole
ja: 大文字と小文字を入れ替える(S)
ko: 대/소문자 바꾸기(S)
pl: Odwróć wielkość liter
pt: Inverter maiúsculas/minúsculas
ro: Inversare majuscule/minuscule
th: สลับตัวพิมพ์(S)
tr: Harf durumunu tersine çevir
uk: Інвертувати регістр
vi: Đảo Chữ hoa/thường
zh_hans: 大小写互换(S)
zh_hant: 大小寫互換(S)

# Menu_Data_CaseSwap.AccessKey
source: S
ar: ب
cs: P
de: U
el: Ν
es: Y
fa: ج
fr: L
hu: F
id: T
it: N
pl: O
pt: N
ro: N
tr: T
uk: І
vi: O

# Menu_Analysis_CustomCrc.Text
source: Define custom CRC...
ar: تعريف CRC مخصص...
cs: Definovat vlastní CRC...
de: Benutzerdefinierten CRC definieren...
el: Ορισμός προσαρμοσμένου CRC...
es: Definir CRC personalizado...
fa: تعریف CRC سفارشی...
fr: Définir un CRC personnalisé...
hu: Egyéni CRC definiálása...
id: Definisikan CRC Kustom...
it: Definisci CRC personalizzato...
ja: カスタム CRC を定義(R)...
ko: 사용자 지정 CRC 정의(R)...
pl: Zdefiniuj niestandardowy CRC...
pt: Definir CRC personalizado...
ro: Definire CRC personalizat...
th: กำหนด CRC เอง(R)...
tr: Özel CRC tanımla...
uk: Визначити власний CRC...
vi: Định nghĩa CRC Tùy chỉnh...
zh_hans: 定义自定义 CRC(R)...
zh_hant: 定義自訂 CRC(R)...

# Menu_Analysis_CustomCrc.AccessKey
source: R
ar: خ
cs: D
de: B
el: Ο
es: P
fa: س
fr: U
hu: E
it: D
pl: Z
pt: P
ro: P
tr: C
uk: C

# HexViewMenu_DataOperation
source: Data operation
ar: عملية بيانات
cs: Datová operace
de: Datenoperation
el: Πράξη δεδομένων
es: Operación de datos
fa: عملیات داده
fr: Opération sur les données
hu: Adatművelet
id: Operasi data
it: Operazione sui dati
ja: データ演算
ko: 데이터 연산
pl: Operacja na danych
pt: Operação de dados
ro: Operație pe date
th: การดำเนินการข้อมูล
tr: Veri işlemi
uk: Операція з даними
vi: Phép toán dữ liệu
zh_hans: 数据运算
zh_hant: 資料運算

# DataOp_Title
source: Data operations
ar: عمليات البيانات
cs: Datové operace
de: Datenoperationen
el: Πράξεις δεδομένων
es: Operaciones de datos
fa: عملیات داده
fr: Opérations sur les données
hu: Adatműveletek
id: Operasi data
it: Operazioni sui dati
ja: データ演算
ko: 데이터 연산
pl: Operacje na danych
pt: Operações de dados
ro: Operații pe date
th: การดำเนินการข้อมูล
tr: Veri işlemleri
uk: Операції з даними
vi: Phép toán dữ liệu
zh_hans: 数据运算
zh_hant: 資料運算

# DataOp_Run
source: Run
ar: تشغيل
cs: Spustit
de: Ausführen
el: Εκτέλεση
es: Ejecutar
fa: اجرا
fr: Exécuter
hu: Futtatás
id: Jalankan
it: Esegui
ja: 実行
ko: 실행
pl: Uruchom
pt: Executar
ro: Executare
th: เรียกใช้
tr: Çalıştır
uk: Виконати
vi: Chạy
zh_hans: 运行
zh_hant: 執行

# DataOp_Category
source: Category
ar: الفئة
cs: Kategorie
de: Kategorie
el: Κατηγορία
es: Categoría
fa: دسته
fr: Catégorie
hu: Kategória
id: Kategori
it: Categoria
ja: 分類
ko: 범주
pl: Kategoria
pt: Categoria
ro: Categorie
th: หมวดหมู่
tr: Kategori
uk: Категорія
vi: Nhóm
zh_hans: 类别
zh_hant: 類別

# DataOp_Kind
source: Operation
ar: العملية
cs: Operace
el: Πράξη
es: Operación
fa: عملیات
fr: Opération
hu: Művelet
id: Operasi
it: Operazione
ja: 演算
ko: 연산
pl: Operacja
pt: Operação
ro: Operație
th: การดำเนินการ
tr: İşlem
uk: Операція
vi: Phép toán
zh_hans: 运算
zh_hant: 運算

# DataOp_Target
source: Target
ar: الهدف
cs: Cíl
de: Ziel
el: Στόχος
es: Destino
fa: هدف
fr: Cible
hu: Cél
it: Destinazione
ja: 対象範囲
ko: 대상
pl: Cel
pt: Destino
ro: Țintă
th: เป้าหมาย
tr: Hedef
uk: Об’єкт
vi: Đối tượng
zh_hans: 目标
zh_hant: 目標

# DataOp_TargetSelection
source: Selection
ar: التحديد
cs: Výběr
de: Auswahl
el: Επιλογή
es: Selección
fa: انتخاب
fr: Sélection
hu: Kijelölés
id: Pilihan
it: Selezione
ja: 選択範囲
ko: 선택 영역
pl: Zaznaczenie
pt: Seleção
ro: Selecție
th: ส่วนที่เลือก
tr: Seçim
uk: Виділення
vi: Vùng chọn
zh_hans: 选定内容
zh_hant: 選取範圍

# DataOp_TargetMultiSelection
source: Selection ({0} ranges)
ar: التحديد ({0} نطاقات)
cs: Výběr (rozsahy: {0})
de: Auswahl ({0} Bereiche)
el: Επιλογή ({0} περιοχές)
es: Selección ({0} rangos)
fa: انتخاب ({0} محدوده)
fr: Sélection ({0} plages)
hu: Kijelölés ({0} tartomány)
id: Pilihan ({0} rentang)
it: Selezione ({0} intervalli)
ja: 選択範囲 ({0} 個の範囲)
ko: 선택 영역(범위 {0}개)
pl: Zaznaczenie (zakresy: {0})
pt: Seleção ({0} intervalos)
ro: Selecție ({0} intervale)
th: ส่วนที่เลือก ({0} ช่วง)
tr: Seçim ({0} aralık)
uk: Виділення (діапазонів: {0})
vi: Vùng chọn ({0} phạm vi)
zh_hans: 选定内容（{0} 个范围）
zh_hant: 選取範圍（{0} 個範圍）

# DataOp_TargetWhole
source: Whole document
ar: المستند بأكمله
cs: Celý dokument
de: Gesamtes Dokument
el: Ολόκληρο το έγγραφο
es: Todo el documento
fa: کل سند
fr: Document entier
hu: Teljes dokumentum
id: Seluruh dokumen
it: Intero documento
ja: ドキュメント全体
ko: 문서 전체
pl: Cały dokument
pt: Documento inteiro
ro: Întregul document
th: ทั้งเอกสาร
tr: Tüm belge
uk: Увесь документ
vi: Toàn bộ tài liệu
zh_hans: 整个文档
zh_hant: 整份文件

# DataOp_TargetRange
source: Range
ar: النطاق
cs: Rozsah
de: Bereich
el: Εύρος
es: Rango
fa: محدوده
fr: Plage
hu: Tartomány
id: Rentang
it: Intervallo
ja: 範囲を指定
ko: 범위
pl: Zakres
pt: Intervalo
ro: Interval
th: ช่วง
tr: Aralık
uk: Діапазон
vi: Phạm vi
zh_hans: 范围
zh_hant: 範圍

# DataOp_RangeStart
source: Start
ar: البداية
cs: Začátek
de: Anfang
el: Αρχή
es: Inicio
fa: آغاز
fr: Début
hu: Kezdet
id: Awal
it: Inizio
ja: 開始
ko: 시작
pl: Początek
pt: Início
ro: Început
th: เริ่มต้น
tr: Başlangıç
uk: Початок
vi: Bắt đầu
zh_hans: 开始
zh_hant: 開始

# DataOp_RangeLength
source: Length
ar: الطول
cs: Délka
de: Länge
el: Μήκος
es: Longitud
fa: طول
fr: Longueur
hu: Hossz
id: Panjang
it: Lunghezza
ja: 長さ
ko: 길이
pl: Długość
pt: Comprimento
ro: Lungime
th: ความยาว
tr: Uzunluk
uk: Довжина
vi: Độ dài
zh_hans: 长度
zh_hant: 長度

# DataOp_Type
source: Element type
ar: نوع العنصر
cs: Typ prvku
de: Elementtyp
el: Τύπος στοιχείου
es: Tipo de elemento
fa: نوع عنصر
fr: Type d'élément
hu: Elemtípus
id: Tipe elemen
it: Tipo di elemento
ja: 要素の型
ko: 요소 형식
pl: Typ elementu
pt: Tipo de elemento
ro: Tip element
th: ชนิดองค์ประกอบ
tr: Öğe türü
uk: Тип елемента
vi: Kiểu phần tử
zh_hans: 元素类型
zh_hant: 元素類型

# DataOp_Type_Unsigned
source: Unsigned integer
ar: عدد صحيح بدون إشارة
cs: Celé číslo bez znaménka
de: Ganzzahl ohne Vorzeichen
el: Ακέραιος χωρίς πρόσημο
es: Entero sin signo
fa: عدد صحیح بدون علامت
fr: Entier non signé
hu: Előjel nélküli egész
id: Bilangan bulat tak bertanda
it: Intero senza segno
ja: 符号なし整数
ko: 부호 없는 정수
pl: Liczba całkowita bez znaku
pt: Inteiro sem sinal
ro: Întreg fără semn
th: จำนวนเต็มไม่มีเครื่องหมาย
tr: İşaretsiz tamsayı
uk: Ціле без знака
vi: Số nguyên không dấu
zh_hans: 无符号整数
zh_hant: 不帶正負號整數

# DataOp_Type_Signed
source: Signed integer
ar: عدد صحيح بإشارة
cs: Celé číslo se znaménkem
de: Ganzzahl mit Vorzeichen
el: Ακέραιος με πρόσημο
es: Entero con signo
fa: عدد صحیح علامت‌دار
fr: Entier signé
hu: Előjeles egész
id: Bilangan bulat bertanda
it: Intero con segno
ja: 符号付き整数
ko: 부호 있는 정수
pl: Liczba całkowita ze znakiem
pt: Inteiro com sinal
ro: Întreg cu semn
th: จำนวนเต็มมีเครื่องหมาย
tr: İşaretli tamsayı
uk: Ціле зі знаком
vi: Số nguyên có dấu
zh_hans: 有符号整数
zh_hant: 帶正負號整數

# DataOp_Type_Float
source: Floating point
ar: فاصلة عائمة
cs: Plovoucí čárka
de: Gleitkommazahl
el: Κινητή υποδιαστολή
es: Punto flotante
fa: ممیز شناور
fr: Virgule flottante
hu: Lebegőpontos
it: Virgola mobile
ja: 浮動小数点
ko: 부동 소수점
pl: Zmiennoprzecinkowy
pt: Ponto flutuante
ro: Virgulă mobilă
th: ทศนิยมลอยตัว
tr: Kayan nokta
uk: Із рухомою комою
vi: Số thực dấu phẩy động
zh_hans: 浮点数
zh_hant: 浮點數

# DataOp_Size
source: Element size (bytes)
ar: حجم العنصر (بايت)
cs: Velikost prvku (bajty)
de: Elementgröße (Bytes)
el: Μέγεθος στοιχείου (byte)
es: Tamaño de elemento (bytes)
fa: اندازهٔ عنصر (بایت)
fr: Taille d'élément (octets)
hu: Elemméret (bájt)
id: Ukuran elemen (byte)
it: Dimensione elemento (byte)
ja: 要素の大きさ (バイト)
ko: 요소 크기(바이트)
pl: Rozmiar elementu (bajty)
pt: Tamanho do elemento (bytes)
ro: Dimensiune element (octeți)
th: ขนาดองค์ประกอบ (ไบต์)
tr: Öğe boyutu (bayt)
uk: Розмір елемента (байти)
vi: Kích thước phần tử (byte)
zh_hans: 元素大小（字节）
zh_hant: 元素大小（位元組）

# DataOp_Endian
source: Byte order
ar: ترتيب البايتات
cs: Pořadí bajtů
de: Bytereihenfolge
el: Σειρά byte
es: Orden de bytes
fa: ترتیب بایت
fr: Boutisme
hu: Bájtsorrend
id: Urutan byte
it: Ordine dei byte
ja: エンディアン
ko: 바이트 순서
pl: Kolejność bajtów
pt: Ordem dos bytes
ro: Ordinea octeților
th: ลำดับไบต์
tr: Bayt sırası
uk: Порядок байтів
vi: Thứ tự byte
zh_hans: 字节序
zh_hant: 位元組順序

# DataOp_Operand
source: Operand
ar: المعامل
el: Τελεστέος
es: Operando
fa: عملوند
fr: Opérande
hu: Operandus
id: Operan
it: Operando
ja: オペランド
ko: 피연산자
pl: Argument
pt: Operando
th: ตัวถูกดำเนินการ
tr: İşlenen
uk: Операнд
vi: Toán hạng
zh_hans: 操作数
zh_hant: 運算元

# DataOp_Increment
source: Operand increment
ar: زيادة المعامل
cs: Přírůstek operandu
de: Operand-Inkrement
el: Βήμα τελεστέου
es: Incremento del operando
fa: افزایش عملوند
fr: Incrément de l'opérande
hu: Operandus növekménye
id: Kenaikan operan
it: Incremento dell'operando
ja: オペランドの増分
ko: 피연산자 증분
pl: Przyrost argumentu
pt: Incremento do operando
ro: Increment operand
th: ส่วนเพิ่มของตัวถูกดำเนินการ
tr: İşlenen artışı
uk: Приріст операнда
vi: Bước tăng toán hạng
zh_hans: 操作数增量
zh_hant: 運算元遞增量

# DataOp_Process
source: Process N elements
ar: معالجة N عنصر
cs: Zpracovat N prvků
de: N Elemente verarbeiten
el: Επεξεργασία N στοιχείων
es: Procesar N elementos
fa: پردازش N عنصر
fr: Traiter N éléments
hu: N elem feldolgozása
id: Proses N elemen
it: Elabora N elementi
ja: 処理する要素の数 (N)
ko: 처리할 요소 수(N)
pl: Przetwórz N elementów
pt: Processar N elementos
ro: Procesare N elemente
th: ประมวลผล N องค์ประกอบ
tr: N öğe işle
uk: Обробити N елементів
vi: Xử lý N phần tử
zh_hans: 每次处理的元素数 (N)
zh_hant: 處理的元素數(N)

# DataOp_Skip
source: then skip M elements
ar: ثم تخطي M عنصر
cs: pak přeskočit M prvků
de: dann M Elemente überspringen
el: και στη συνέχεια παράλειψη M στοιχείων
es: y luego omitir M elementos
fa: سپس رد کردن M عنصر
fr: puis ignorer M éléments
hu: majd M elem kihagyása
id: lalu lewati M elemen
it: poi salta M elementi
ja: 飛ばす要素の数 (M)
ko: 그다음 건너뛸 요소 수(M)
pl: następnie pomiń M elementów
pt: depois pular M elementos
ro: apoi omitere M elemente
th: แล้วข้าม M องค์ประกอบ
tr: sonra M öğe atla
uk: потім пропустити M елементів
vi: rồi bỏ qua M phần tử
zh_hans: 随后跳过的元素数 (M)
zh_hant: 接著略過的元素數(M)

# DataOp_IncrementScope
source: Increment across ranges
ar: الزيادة عبر النطاقات
cs: Přírůstek napříč rozsahy
de: Inkrement über Bereiche
el: Βήμα μεταξύ περιοχών
es: Incremento entre rangos
fa: افزایش در سراسر محدوده‌ها
fr: Incrément entre les plages
hu: Növekmény tartományokon át
id: Kenaikan antar rentang
it: Incremento tra intervalli
ja: 範囲ごとの増分
ko: 범위 간 증분
pl: Przyrost między zakresami
pt: Incremento entre intervalos
ro: Increment între intervale
th: ส่วนเพิ่มข้ามช่วง
tr: Aralıklar boyunca artış
uk: Приріст через діапазони
vi: Bước tăng qua các phạm vi
zh_hans: 跨范围的增量
zh_hant: 跨範圍遞增

# DataOp_IncrementScope_PerRange
source: Restart for each range
ar: البدء من جديد لكل نطاق
cs: Začít znovu pro každý rozsah
de: Für jeden Bereich neu beginnen
el: Επανεκκίνηση για κάθε περιοχή
es: Reiniciar en cada rango
fa: شروع دوباره برای هر محدوده
fr: Recommencer pour chaque plage
hu: Újrakezdés tartományonként
id: Mulai ulang untuk setiap rentang
it: Ricomincia per ogni intervallo
ja: 範囲ごとにやり直す
ko: 범위마다 다시 시작
pl: Zaczynaj od nowa dla każdego zakresu
pt: Reiniciar em cada intervalo
ro: Reluare pentru fiecare interval
th: เริ่มใหม่ในแต่ละช่วง
tr: Her aralıkta yeniden başlat
uk: Починати заново в кожному діапазоні
vi: Bắt đầu lại ở mỗi phạm vi
zh_hans: 每个范围重新开始
zh_hant: 每個範圍重新開始

# DataOp_IncrementScope_Continuous
source: Continue across ranges
ar: المتابعة عبر النطاقات
cs: Pokračovat napříč rozsahy
de: Über Bereiche hinweg fortsetzen
el: Συνέχεια σε όλες τις περιοχές
es: Continuar entre rangos
fa: ادامه در سراسر محدوده‌ها
fr: Continuer d'une plage à l'autre
hu: Folytatás a tartományokon át
id: Lanjutkan melintasi rentang
it: Continua tra gli intervalli
ja: 範囲をまたいで続ける
ko: 범위를 넘어 계속
pl: Kontynuuj między zakresami
pt: Continuar entre intervalos
ro: Continuare între intervale
th: ต่อเนื่องข้ามช่วง
tr: Aralıklar boyunca sürdür
uk: Продовжувати через діапазони
vi: Tiếp tục qua các phạm vi
zh_hans: 跨范围继续
zh_hant: 跨範圍繼續

# DataOp_Overflow
source: On overflow
ar: عند التجاوز
cs: Při přetečení
de: Bei Überlauf
el: Σε υπερχείλιση
es: Al desbordarse
fa: هنگام سرریز
fr: En cas de dépassement
hu: Túlcsorduláskor
id: Saat meluap
it: In caso di overflow
ja: あふれたときの扱い
ko: 오버플로 시
pl: Przy przepełnieniu
pt: Em caso de estouro
ro: La depășire
th: เมื่อล้น
tr: Taşmada
uk: У разі переповнення
vi: Khi tràn
zh_hans: 溢出时
zh_hant: 溢位時

# DataOp_Overflow_Wrap
source: Wrap
ar: التفاف
cs: Přetočit
de: Umbrechen
el: Αναδίπλωση
es: Ajustar
fa: چرخشی
fr: Boucler
hu: Körbefordulás
id: Putar balik
it: Riavvolgi
ja: ラップ
ko: 순환
pl: Zawiń
pt: Circular
ro: Circular
th: วนรอบ
tr: Başa sar
uk: Циклічне перенесення
vi: Quay vòng
zh_hans: 回绕
zh_hant: 環繞

# DataOp_Overflow_Saturate
source: Saturate
ar: تشبع
cs: Saturovat
de: Sättigen
el: Κορεσμός
es: Saturar
fa: اشباع
fr: Saturer
hu: Telítés
id: Saturasi
it: Satura
ja: 飽和
ko: 포화
pl: Nasyć
pt: Saturar
ro: Saturare
th: อิ่มตัว
tr: Doygunlaştır
uk: Насичення
vi: Bão hòa
zh_hans: 饱和
zh_hant: 飽和

# DataOp_OperandSource
source: Operand
ar: المعامل
el: Τελεστέος
es: Operando
fa: عملوند
fr: Opérande
hu: Operandus
id: Operan
it: Operando
ja: オペランドの指定
ko: 피연산자
pl: Argument
pt: Operando
th: ตัวถูกดำเนินการ
tr: İşlenen
uk: Операнд
vi: Toán hạng
zh_hans: 操作数
zh_hant: 運算元

# DataOp_OperandSource_Number
source: Number
ar: رقم
cs: Číslo
de: Zahl
el: Αριθμός
es: Número
fa: عدد
fr: Nombre
hu: Szám
id: Angka
it: Numero
ja: 数値
ko: 숫자
pl: Liczba
pt: Número
ro: Număr
th: ตัวเลข
tr: Sayı
uk: Число
vi: Số
zh_hans: 数值
zh_hant: 數值

# DataOp_OperandSource_Key
source: Byte key
ar: مفتاح بايتات
cs: Bajtový klíč
de: Byteschlüssel
el: Κλειδί byte
es: Clave de bytes
fa: کلید بایتی
fr: Clé d'octets
hu: Bájtkulcs
id: Kunci byte
it: Chiave in byte
ja: バイト列の鍵
ko: 바이트 키
pl: Klucz bajtowy
pt: Chave de bytes
ro: Cheie de octeți
th: คีย์ไบต์
tr: Bayt anahtarı
uk: Байтовий ключ
vi: Khóa byte
zh_hans: 字节密钥
zh_hant: 位元組金鑰

# DataOp_KeyOrigin
source: Key starts at
ar: يبدأ المفتاح عند
cs: Klíč začíná na
de: Schlüssel beginnt bei
el: Το κλειδί ξεκινά από
es: La clave empieza en
fa: کلید از اینجا آغاز می‌شود
fr: La clé commence à
hu: Kulcs kezdete
id: Kunci dimulai di
it: La chiave inizia da
ja: 鍵の起点
ko: 키 시작 위치
pl: Klucz zaczyna się od
pt: A chave começa em
ro: Cheia începe la
th: คีย์เริ่มที่
tr: Anahtar başlangıcı
uk: Початок ключа
vi: Khóa bắt đầu tại
zh_hans: 密钥起始位置
zh_hant: 金鑰起始位置

# DataOp_KeyIncrement
source: Key increment per round
ar: زيادة المفتاح في كل دورة
cs: Přírůstek klíče za kolo
de: Schlüsselinkrement pro Durchlauf
el: Βήμα κλειδιού ανά κύκλο
es: Incremento de la clave por vuelta
fa: افزایش کلید در هر دور
fr: Incrément de la clé par tour
hu: Kulcs növekménye körönként
id: Kenaikan kunci per putaran
it: Incremento della chiave per ciclo
ja: 鍵の増分 (1 周ごと)
ko: 회차당 키 증분
pl: Przyrost klucza na cykl
pt: Incremento da chave por ciclo
ro: Increment cheie pe ciclu
th: ส่วนเพิ่มของคีย์ต่อรอบ
tr: Tur başına anahtar artışı
uk: Приріст ключа за прохід
vi: Bước tăng khóa mỗi vòng
zh_hans: 每轮密钥增量
zh_hant: 每輪的金鑰遞增量

# DataOp_XorNote
source: Running XOR twice with the same settings restores the original data.
ar: تشغيل XOR مرتين بالإعدادات نفسها يستعيد البيانات الأصلية.
cs: Dvojí provedení XOR se stejným nastavením obnoví původní data.
de: Wird XOR zweimal mit denselben Einstellungen ausgeführt, werden die ursprünglichen Daten wiederhergestellt.
el: Η εκτέλεση του XOR δύο φορές με τις ίδιες ρυθμίσεις επαναφέρει τα αρχικά δεδομένα.
es: Ejecutar XOR dos veces con la misma configuración restaura los datos originales.
fa: اجرای دوبارهٔ XOR با همان تنظیمات دادهٔ اصلی را بازمی‌گرداند.
fr: Exécuter XOR deux fois avec les mêmes paramètres restaure les données d'origine.
hu: Ha az XOR-t kétszer futtatja ugyanazokkal a beállításokkal, visszaáll az eredeti adat.
id: Menjalankan XOR dua kali dengan pengaturan yang sama mengembalikan data asli.
it: Eseguendo lo XOR due volte con le stesse impostazioni si ripristinano i dati originali.
ja: 同じ設定で XOR を 2 回実行すると元のデータに戻ります。
ko: 같은 설정으로 XOR을 두 번 실행하면 원래 데이터로 돌아갑니다.
pl: Dwukrotne wykonanie XOR z tymi samymi ustawieniami przywraca oryginalne dane.
pt: Executar o XOR duas vezes com as mesmas configurações restaura os dados originais.
ro: Executarea XOR de două ori cu aceleași setări restaurează datele originale.
th: การเรียกใช้ XOR สองครั้งด้วยการตั้งค่าเดียวกันจะคืนข้อมูลต้นฉบับ
tr: XOR'u aynı ayarlarla iki kez çalıştırmak özgün veriyi geri yükler.
uk: Повторне виконання XOR з тими самими параметрами відновлює вихідні дані.
vi: Chạy XOR hai lần với cùng cài đặt sẽ khôi phục dữ liệu gốc.
zh_hans: 使用相同设置执行两次 XOR 即可还原原始数据。
zh_hant: 以相同設定執行兩次 XOR 會還原原始資料。

# DataOp_ShiftBits
source: Bits
ar: البتات
cs: Bity
el: Bit
fa: بیت‌ها
hu: Bitek
id: Bit
it: Bit
ja: ビット数
ko: 비트 수
pl: Bity
ro: Biți
th: บิต
tr: Bit
uk: Біти
vi: Số bit
zh_hans: 位数
zh_hant: 位元數

# DataOp_RotateIncrement
source: Rotation increment
ar: زيادة التدوير
cs: Přírůstek rotace
de: Rotationsinkrement
el: Βήμα περιστροφής
es: Incremento de rotación
fa: افزایش چرخش
fr: Incrément de rotation
hu: Forgatás növekménye
id: Kenaikan rotasi
it: Incremento della rotazione
ja: 回転量の増分
ko: 회전 증분
pl: Przyrost rotacji
pt: Incremento da rotação
ro: Increment rotire
th: ส่วนเพิ่มของการหมุน
tr: Döndürme artışı
uk: Приріст зсуву
vi: Bước tăng xoay
zh_hans: 循环移位增量
zh_hant: 旋轉遞增量

# DataOp_Min
source: Minimum
ar: الحد الأدنى
el: Ελάχιστο
es: Mínimo
fa: حداقل
it: Minimo
ja: 最小値
ko: 최솟값
pt: Mínimo
ro: Minim
th: ต่ำสุด
tr: En küçük
uk: Мінімум
vi: Nhỏ nhất
zh_hans: 最小值
zh_hant: 最小值

# DataOp_Max
source: Maximum
ar: الحد الأقصى
el: Μέγιστο
es: Máximo
fa: حداکثر
id: Maksimum
it: Massimo
ja: 最大値
ko: 최댓값
pl: Maksimum
pt: Máximo
ro: Maxim
th: สูงสุด
tr: En büyük
uk: Максимум
vi: Lớn nhất
zh_hans: 最大值
zh_hant: 最大值

# DataOp_NoLimit
source: No limit
ar: بلا حد
cs: Bez omezení
de: Keine Begrenzung
el: Χωρίς όριο
es: Sin límite
fa: بدون محدودیت
fr: Aucune limite
hu: Nincs korlát
id: Tanpa batas
it: Nessun limite
ja: 制限しない
ko: 제한 없음
pl: Bez limitu
pt: Sem limite
ro: Fără limită
th: ไม่จำกัด
tr: Sınır yok
uk: Без обмеження
vi: Không giới hạn
zh_hans: 无限制
zh_hant: 無限制

# DataOp_BitOffset
source: Byte offset
ar: إزاحة البايت
cs: Posun bajtu
el: Μετατόπιση byte
es: Desplazamiento en bytes
fa: آفست بایت
fr: Décalage en octets
hu: Bájteltolás
id: Offset byte
it: Offset in byte
ja: 位置 (バイトのオフセット)
ko: 바이트 오프셋
pl: Przesunięcie w bajtach
pt: Deslocamento em bytes
ro: Deplasament octet
th: ออฟเซ็ตไบต์
tr: Bayt ofseti
uk: Зміщення байта
vi: Độ lệch byte
zh_hans: 字节偏移量
zh_hant: 位元組位移

# DataOp_BitIndex
source: Bit in the byte (7 = most significant)
ar: البت داخل البايت (7 = الأعلى أهمية)
cs: Bit v bajtu (7 = nejvyšší)
de: Bit im Byte (7 = höchstwertiges)
el: Bit μέσα στο byte (7 = σημαντικότερο)
es: Bit dentro del byte (7 = más significativo)
fa: بیت درون بایت (7 = پرارزش‌ترین)
fr: Bit dans l'octet (7 = poids fort)
hu: Bit a bájton belül (7 = legmagasabb helyiértékű)
id: Bit dalam byte (7 = paling signifikan)
it: Bit nel byte (7 = più significativo)
ja: バイト内のビット (7 が最上位)
ko: 바이트 내 비트(7 = 최상위)
pl: Bit w bajcie (7 = najbardziej znaczący)
pt: Bit no byte (7 = mais significativo)
ro: Bitul din octet (7 = cel mai semnificativ)
th: บิตในไบต์ (7 = สำคัญที่สุด)
tr: Bayttaki bit (7 = en anlamlı)
uk: Біт у байті (7 = старший)
vi: Bit trong byte (7 = cao nhất)
zh_hans: 字节中的位（7 = 最高有效位）
zh_hant: 位元組中的位元（7 = 最高位）

# DataOp_BitCount
source: Number of bits
ar: عدد البتات
cs: Počet bitů
de: Anzahl der Bits
el: Αριθμός bit
es: Número de bits
fa: تعداد بیت‌ها
fr: Nombre de bits
hu: Bitek száma
id: Jumlah bit
it: Numero di bit
ja: ビット数
ko: 비트 수
pl: Liczba bitów
pt: Número de bits
ro: Număr de biți
th: จำนวนบิต
tr: Bit sayısı
uk: Кількість бітів
vi: Số bit
zh_hans: 位数
zh_hant: 位元數
